run/verwijlen/case0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleRheoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-06;

writeControl    adjustable;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo          2.5e-04;

functions
{
	forces
    {
        type            rheoForces;
        libs            ("libiRheoFoamPostProcess.so");
        writeControl    writeTime;
        writeFields		false;
        areaPatches		(staticRod);
        calcBulkForce	false;
        x0				2e-03;
    }
}

libs ("libiRheo.so");

// ************************************************************************* //
