run/verwijlen/case0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
interfaceModel		extensionalViscosity;
interfacePatch		front;
movingPatch			movingRod;

// Dimensionless numbers
Theta 	50;
Ma		16000;
Tr		4;
Pes		2e5;
Bq		100;

// Isotherm model for the calculation of the Marangoni modulus
isothermModel       idealGas;
// ************************************************************************* //
