run/verwijlen/case0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    staticRod
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    walls
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }  
    movingRod
    {
    	type            uniformFixedValue;
        uniformValue    (0 0 0);
    }     
    front
    {
    	type            uniformFixedValue;
        uniformValue    (0 0 0);
    } 
    back
    {
    	type            uniformFixedValue;
        uniformValue    (0 0 0);
    } 
}


// ************************************************************************* //
