run/verwijlen/case0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    staticRod
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }  
    movingRod
    {
    	type            zeroGradient;
    }     
    front
    {
    	type            zeroGradient;
    } 
    back
    {
    	type            zeroGradient;
    } 
}


// ************************************************************************* //
