run/verwijlen/case0/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    staticRod
    {
        type            fixedValue;
        value    		uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value    		uniform (0 0 0);
    }  
    movingRod
    {
    	type            fixedValue;
        value    		uniform (0 0 0);
    }  
}


// ************************************************************************* //
