run/verwijlen/case0/0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionUx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

    movingRod
    {   
        type    codedFixedValue;
        value	uniform 0;
        name 	pointMotionUx_movingRod;
        code
        #{
            const scalar t = this->db().time().value();
            operator==(exp(t));
            Info<< "movingRod: u_x = " << exp(t) << endl;
        #};
    }
  
    front
    {
        type            zeroGradient;
    }
    
    back
    {
        type            zeroGradient;
    }
    
    staticRod
    {
    	type            uniformFixedValue;
        uniformValue    constant 0;
    }
}


// ************************************************************************* //
