run/verwijlen/case0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0;
        smoother        GaussSeidel;
    }
    
    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    "pcorr.*"
    {
        $p
        tolerance       1e-07;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    UFinal
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    }
    cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    cellMotionUxFinal
    {
        $cellMotionUx;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          false;
    momentumPredictor 	false;
    nOuterCorrectors   	100; // Number of iterations
    nCorrectors         0;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    equations
    {
        U           1;
    }
    fields
    {
    	p			1;
    }
}


// ************************************************************************* //
