run/verwijlen/case0/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  ( front );

boundary
{
	walls
    {
        type                patch;
        neighbourPolyPatch  walls;
    }

    staticRod
    {
        type            	patch;
        neighbourPolyPatch  staticRod;
    }
    
    movingRod
    {
        type            	patch;
        neighbourPolyPatch  movingRod;
    } 
}


defaultPatch
{
    name    empty;
    type    empty;
}


// ************************************************************************** //
