run/verwijlen/case0/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
cylinder.obj
{
    extractionMethod     extractFromSurface;

        includedAngle        150;

        geometricTestOnly    yes;

        subsetFeatures
        {
        nonManifoldEdges yes;
        openEdges        yes;
        }

        trimFeatures
        {
        minElem          0;
        minLen           0;
        }

        writeObj             yes;
}
staticRod.stl
{
    extractionMethod     extractFromSurface;

        includedAngle        150;

        geometricTestOnly    yes;

        subsetFeatures
        {
        nonManifoldEdges yes;
        openEdges        yes;
        }

        trimFeatures
        {
        minElem          0;
        minLen           0;
        }

        writeObj             no;
}
movingRod.stl
{
    extractionMethod     extractFromSurface;

        includedAngle        150;

        geometricTestOnly    yes;

        subsetFeatures
        {
        nonManifoldEdges yes;
        openEdges        yes;
        }

        trimFeatures
        {
        minElem          0;
        minLen           0;
        }

        writeObj             no;
}


// ************************************************************************* //
